app/views/api/v1/campaign/index.html.erb

	<% @campaign.uniq.each do |c| %>
		<% @com =  Campaign.where('campaign =?',c).count %>
---
SELECT COUNT(*) FROM `campaigns` WHERE (campaign like 'ssss_uk_01B' and validity like 'during')