app/controllers/api/v1/campaign_controller.rb

SELECT `campaigns`.* FROM `campaigns`
---
      def index
        @results = Campaign.all

SELECT `campaigns`.* FROM `campaigns` WHERE (campaign like 'ssss_uk_02A')
---
      def show
        @campaigns = Campaign.where('campaign =?',params[:id])